turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cm/atdf/ATSAM4CMS8C_0.atdf
        <register caption="TimeStamp Date Register 0" name="RTC_TSDR0" offset="0xB4" rw="R" size="4">
          <bitfield caption="Century of the Tamper" mask="0x0000007F" name="CENT"/>
          <bitfield caption="Year of the Tamper" mask="0x0000FF00" name="YEAR"/>
          <bitfield caption="Month of the Tamper" mask="0x001F0000" name="MONTH"/>
          <bitfield caption="Day of the Tamper" mask="0x00E00000" name="DAY"/>
          <bitfield caption="Date of the Tamper" mask="0x3F000000" name="DATE"/>
        </register>
        <register caption="TimeStamp Source Register 0" name="RTC_TSSR0" offset="0xB8" rw="R" size="4">
          <bitfield caption="Tamper Source" mask="0x00000003" name="TSRC"/>
        </register>
        <register caption="TimeStamp Time Register 1" name="RTC_TSTR1" offset="0xBC" rw="R" size="4">
          <bitfield caption="Seconds of the Tamper" mask="0x0000007F" name="SEC"/>
          <bitfield caption="Minutes of the Tamper" mask="0x00007F00" name="MIN"/>
          <bitfield caption="Hours of the Tamper" mask="0x003F0000" name="HOUR"/>
          <bitfield caption="AM/PM Indicator of the Tamper" mask="0x00400000" name="AMPM"/>
          <bitfield caption="System Mode of the Tamper" mask="0x80000000" name="BACKUP"/>
        </register>
        <register caption="TimeStamp Date Register 1" name="RTC_TSDR1" offset="0xC0" rw="R" size="4">
          <bitfield caption="Century of the Tamper" mask="0x0000007F" name="CENT"/>
          <bitfield caption="Year of the Tamper" mask="0x0000FF00" name="YEAR"/>
          <bitfield caption="Month of the Tamper" mask="0x001F0000" name="MONTH"/>
          <bitfield caption="Day of the Tamper" mask="0x00E00000" name="DAY"/>
          <bitfield caption="Date of the Tamper" mask="0x3F000000" name="DATE"/>
        </register>
        <register caption="TimeStamp Source Register 1" name="RTC_TSSR1" offset="0xC4" rw="R" size="4">
          <bitfield caption="Tamper Source" mask="0x00000003" name="TSRC"/>
        </register>
        <register caption="Write Protection Mode Register" name="RTC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="RTC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="RTC_CR__TIMEVSEL">
        <value caption="Minute change" name="MINUTE" value="0x0"/>
        <value caption="Hour change" name="HOUR" value="0x1"/>
        <value caption="Every day at midnight" name="MIDNIGHT" value="0x2"/>
        <value caption="Every day at noon" name="NOON" value="0x3"/>
      </value-group>
      <value-group caption="" name="RTC_CR__CALEVSEL">
        <value caption="Week change (every Monday at time 00:00:00)" name="WEEK" value="0x0"/>
        <value caption="Month change (every 01 of each month at time 00:00:00)" name="MONTH" value="0x1"/>
        <value caption="Year change (every January 1 at time 00:00:00)" name="YEAR" value="0x2"/>
      </value-group>
      <value-group caption="" name="RTC_MR__OUT0">
        <value caption="No waveform, stuck at '0'" name="NO_WAVE" value="0x0"/>
        <value caption="1 Hz square wave" name="FREQ1HZ" value="0x1"/>
        <value caption="32 Hz square wave" name="FREQ32HZ" value="0x2"/>
        <value caption="64 Hz square wave" name="FREQ64HZ" value="0x3"/>
        <value caption="512 Hz square wave" name="FREQ512HZ" value="0x4"/>
        <value caption="Output toggles when alarm flag rises" name="ALARM_TOGGLE" value="0x5"/>
        <value caption="Output is a copy of the alarm flag" name="ALARM_FLAG" value="0x6"/>
        <value caption="Duty cycle programmable pulse" name="PROG_PULSE" value="0x7"/>
      </value-group>
      <value-group caption="" name="RTC_MR__THIGH">
        <value caption="31.2 ms" name="H_31MS" value="0x0"/>
        <value caption="15.6 ms" name="H_16MS" value="0x1"/>
        <value caption="3.91 ms" name="H_4MS" value="0x2"/>
        <value caption="976 us" name="H_976US" value="0x3"/>
        <value caption="488 us" name="H_488US" value="0x4"/>
        <value caption="122 us" name="H_122US" value="0x5"/>
        <value caption="30.5 us" name="H_30US" value="0x6"/>
        <value caption="15.2 us" name="H_15US" value="0x7"/>
      </value-group>
      <value-group caption="" name="RTC_MR__TPERIOD">
        <value caption="1 second" name="P_1S" value="0x0"/>
        <value caption="500 ms" name="P_500MS" value="0x1"/>
        <value caption="250 ms" name="P_250MS" value="0x2"/>
        <value caption="125 ms" name="P_125MS" value="0x3"/>
      </value-group>
      <value-group caption="" name="RTC_SR__ACKUPD">
        <value caption="Time and calendar registers cannot be updated." name="FREERUN" value="0"/>
        <value caption="Time and calendar registers can be updated." name="UPDATE" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__ALARM">
        <value caption="No alarm matching condition occurred." name="NO_ALARMEVENT" value="0"/>
        <value caption="An alarm matching condition has occurred." name="ALARMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__SEC">
        <value caption="No second event has occurred since the last clear." name="NO_SECEVENT" value="0"/>
        <value caption="At least one second event has occurred since the last clear." name="SECEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__TIMEV">
        <value caption="No time event has occurred since the last clear." name="NO_TIMEVENT" value="0"/>
        <value caption="At least one time event has occurred since the last clear." name="TIMEVENT" value="1"/>
      </value-group>
      <value-group caption="" name="RTC_SR__CALEV">
        <value caption="No calendar event has occurred since the last clear." name="NO_CALEVENT" value="0"/>
        <value caption="At least one calendar event has occurred since the last clear." name="CALEVENT" value="1"/>
      </value-group>
